In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('grocery_sales.csv')

In [4]:
df.head(3)

  storeID  product  quantity  revenue
0       A   Apples      1811   9300.6
1       A  Bananas      1003   3375.2
2       A  Oranges      1604   8528.5

###  Calculate the price from the quantity sold and revenue

In [5]:
df['price'] = df['revenue'] / df['quantity']

In [6]:
df = df.drop(['quantity', 'revenue'], axis=1)

In [7]:
df.head()

  storeID  product     price
0       A   Apples  5.135616
1       A  Bananas  3.365105
2       A  Oranges  5.317020
3       B   Apples  5.143417
4       B  Bananas  3.898517